Data/Final_Implemented_data/Concurrency/Round/test_round4.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient).....done


Server Software:        SimpleHTTP/0.6
Server Hostname:        10.1.0.0
Server Port:            80

Document Path:          /test_100kb.txt
Document Length:        102400 bytes

Concurrency Level:      10
Time taken for tests:   4.835 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      10259000 bytes
HTML transferred:       10240000 bytes
Requests per second:    20.68 [#/sec] (mean)
Time per request:       483.477 [ms] (mean)
Time per request:       48.348 [ms] (mean, across all concurrent requests)
Transfer rate:          2072.19 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      138  376 147.4    336     704
Processing:     1   79  76.3     57     282
Waiting:        1   76  74.5     55     274
Total:        205  455 165.4    433     906

Percentage of the requests served within a certain time (ms)
  50%    433
  66%    503
  75%    558
  80%    597
  90%    705
  95%    784
  98%    895
  99%    906
 100%    906 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient).....done


Server Software:        SimpleHTTP/0.6
Server Hostname:        10.1.0.0
Server Port:            80

Document Path:          /test_100kb.txt
Document Length:        102400 bytes

Concurrency Level:      20
Time taken for tests:   3.379 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      10259000 bytes
HTML transferred:       10240000 bytes
Requests per second:    29.59 [#/sec] (mean)
Time per request:       675.807 [ms] (mean)
Time per request:       33.790 [ms] (mean, across all concurrent requests)
Transfer rate:          2964.92 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      110  494 200.0    455     826
Processing:     2  136 118.7    126     433
Waiting:        1  134 118.5    126     428
Total:        131  630 256.4    605    1155

Percentage of the requests served within a certain time (ms)
  50%    605
  66%    739
  75%    836
  80%    867
  90%   1004
  95%   1052
  98%   1151
  99%   1155
 100%   1155 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient)...Total of 97 requests completed